src/test/jmeter/AESGCMTestPlan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AES/GCM Benchmark">
      <stringProp name="TestPlan.comments">Benchmark for testing AES/GCM encryption/decryption performance</stringProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">../../../test-classes/</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NumberOfThreads" elementType="Argument">
            <stringProp name="Argument.name">NumberOfThreads</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.desc">Number of threads for multithread tests</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NumberOfLoops" elementType="Argument">
            <stringProp name="Argument.name">NumberOfLoops</stringProp>
            <stringProp name="Argument.value">10000</stringProp>
            <stringProp name="Argument.desc">Number of loops to run a given test</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RampUpTime" elementType="Argument">
            <stringProp name="Argument.name">RampUpTime</stringProp>
            <stringProp name="Argument.value">20</stringProp>
            <stringProp name="Argument.desc">Time in seconds to ramp up before collecting data</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TotalIterations" elementType="Argument">
            <stringProp name="Argument.name">TotalIterations</stringProp>
            <stringProp name="Argument.value">500</stringProp>
            <stringProp name="Argument.desc">Number of iterations for entire benchmark ( each benchmark loops NumberOfLoops )</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AES/GCM Encrypt Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SunJCE AES/GCM Encrypt Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">SunJCE</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="BC AES/GCM Encrypt Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">BC</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AES/GCM Encrypt Thread Group Multithread">
        <stringProp name="ThreadGroup.num_threads">${NumberOfThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">${NumberOfThreads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AES/GCM Encrypt And Decrypt Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt And Decrypt" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">EncryptDecrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AES/GCM Encrypt And Decrypt Thread Group Multithread">
        <stringProp name="ThreadGroup.num_threads">${NumberOfThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt And Decrypt" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">EncryptDecrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">1024</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">${NumberOfThreads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AESGCM Large Data Test">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt Large Data" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">102400</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OpenJCEPlus AESGCM Large Data Test Multithread">
        <stringProp name="ThreadGroup.num_threads">${NumberOfThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTime}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${TotalIterations}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="AES/GCM Encrypt Large Data" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="operation" elementType="Argument">
                <stringProp name="Argument.name">operation</stringProp>
                <stringProp name="Argument.value">Encrypt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="dataSize" elementType="Argument">
                <stringProp name="Argument.name">dataSize</stringProp>
                <stringProp name="Argument.value">102400</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider" elementType="Argument">
                <stringProp name="Argument.name">provider</stringProp>
                <stringProp name="Argument.value">OpenJCEPlus</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="loops" elementType="Argument">
                <stringProp name="Argument.name">loops</stringProp>
                <stringProp name="Argument.value">${NumberOfLoops}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="threads" elementType="Argument">
                <stringProp name="Argument.name">threads</stringProp>
                <stringProp name="Argument.value">${NumberOfThreads}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">ibm.jceplus.jmeter.AESGCMBenchmark</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>